tap "aws/tap"
tap "eugenmayer/dockersync"
tap "fujiwara/tap"
tap "github/gh"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "kayac/tap"
tap "knqyf263/utern"
tap "railwaycat/emacsmacport"
tap "remind101/formulae"
tap "tkengo/highway"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Apache Portable Runtime library
brew "apr"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Official Amazon AWS command-line interface
brew "awscli@1"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Interpreted, interactive, object-oriented programming language
brew "python"
# C++ library for large-scale optimization
brew "ceres-solver"
# Computational Geometry Algorithms Library
brew "cgal"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Load/unload environment variables based on $PWD
brew "direnv"
# Image manipulation library
brew "jpeg"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Network authentication protocol
brew "krb5"
# GNOME XML library
brew "libxml2", link: true
# Framework for scientific data networking
brew "libdap"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Postgres C API library
brew "libpq"
# Package for scientific computing with Python
brew "numpy"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Validating XML parser
brew "xerces-c"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# YAML Parser
brew "libyaml"
# Powerful, clean, object-oriented scripting language
brew "ruby"
brew "gem-docker-sync"
brew "gem-html2haml"
brew "gem-irep"
brew "gem-pry"
brew "gem-rails-erd"
brew "gem-rebi"
brew "gem-solargraph"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Perceptual JPEG encoder
brew "guetzli"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# The mind to rule processes of your development environment
brew "hivemind"
# Platform built on V8 to build network applications
brew "node", link: false
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Load testing and performance measurement application
brew "jmeter"
# Utility to optimize JPEG files
brew "jpegoptim"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Allows SpatiaLite to support ST_MakeValid() like PostGIS
brew "liblwgeom"
# Library to render SVG files using Cairo
brew "librsvg"
# NaCl networking and cryptography library
brew "libsodium"
# USB multiplexor library for iOS devices
brew "libusbmuxd", args: ["HEAD"]
# C XSLT library for GNOME
brew "libxslt"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Improved JPEG encoder
brew "mozjpeg"
# Open source relational database management system
brew "mysql@5.7", link: true
# Wrap web apps natively
brew "nativefier"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Statically typed compiled systems programming language
brew "nim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Open source computer vision library
brew "opencv"
# PNG file optimizer
brew "optipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# PNG image optimizing utility
brew "pngquant"
# Object-relational database system
brew "postgresql"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@10"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Google's open source JavaScript engine
brew "v8@3.15"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A layer for unison-fsmonitor arround either macfsevents or watchdog for usage with unison
brew "eugenmayer/dockersync/unox"
brew "fujiwara/tap/lambroll"
# GitHub CLI
brew "github/gh/gh"
brew "kayac/tap/ecspresso"
# Multi group and stream log tailing for AWS CloudWatch Logs
brew "knqyf263/utern/utern"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# High performance source code search tool.
brew "tkengo/highway/highway"
cask "cacher"
cask "hyper"
cask "ngrok"
cask "vagrant"
cask "xquartz"
