tap "arto-app/tap"
tap "aws/tap"
tap "b4b4r07/tap"
tap "eugenmayer/dockersync"
tap "fujiwara/tap"
tap "github/gh"
tap "go-delve/delve"
tap "handlename/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "k1low/tap", "https://github.com/k1LoW/homebrew-tap"
tap "kayac/tap"
tap "knqyf263/utern"
tap "manaflow-ai/cmux"
tap "mashiike/tap"
tap "microsoft/git"
tap "minamijoyo/tfupdate"
tap "mutagen-io/mutagen"
tap "railwaycat/emacsmacport"
tap "remind101/formulae"
tap "shuuuuun/tap"
tap "songmu/tap"
tap "stripe/stripe-cli"
# Run your GitHub Actions locally
brew "act"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Declarative CLI Version manager
brew "aqua"
# Portable library for network traffic capture
brew "libpcap"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Text processing system for reStructuredText
brew "docutils"
# YAML Parser
brew "libyaml"
# Python 2 and 3 compatibility utilities
brew "six"
# Official Amazon AWS command-line interface
brew "awscli@1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Garbage collector for C and C++
brew "bdw-gc"
# High performance key/value database
brew "berkeley-db", link: true
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU compiler collection
brew "gcc"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Computational Geometry Algorithms Library
brew "cgal"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Unit testing framework for C
brew "cmocka"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Creates slide deck using Markdown and Google Slides
brew "deck"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Asynchronous event library
brew "libevent"
# NaCl networking and cryptography library
brew "libsodium"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# TIFF library and utilities
brew "libtiff"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# OpenType text shaping engine
brew "harfbuzz"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Package for scientific computing with Python
brew "numpy"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Open h.265 video codec implementation
brew "libde265"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# GNOME XML library
brew "libxml2", link: true
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Database of common MIME types
brew "shared-mime-info"
# Validating XML parser
brew "xerces-c"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
brew "gem-foreman"
brew "gem-irep"
brew "gem-rubocop"
brew "gem-solargraph"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Perceptual JPEG encoder
brew "guetzli"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Process manager for Procfile-based applications
brew "hivemind"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Json incremental digger
brew "jid"
# Load testing and performance measurement application
brew "jmeter"
# Image manipulation library
brew "jpeg", link: true
# Utility to optimize JPEG files
brew "jpegoptim"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Terminal file manager
brew "lf"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Framework for scientific data networking
brew "libdap"
# Cartographic Projections Library
brew "proj@7"
# Allows SpatiaLite to support ST_MakeValid() like PostGIS
brew "liblwgeom"
# General purpose TCP-IP emulator
brew "libslirp"
# C XSLT library for GNOME
brew "libxslt"
# Utility for directing compilation
brew "make"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Improved JPEG encoder
brew "mozjpeg"
# Open source relational database management system
brew "mysql@5.7", link: true
# Wrap web apps natively
brew "nativefier"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Statically typed compiled systems programming language
brew "nim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
brew "npm-google-clasp"
brew "npm-koko"
brew "npm-rgb-hex-cli"
brew "npm-serverless"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# PNG file optimizer
brew "optipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers library
brew "protobuf-c"
# C++ wrapper library around CGAL
brew "sfcgal"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@10"
# Show ps output as a tree
brew "pstree"
# Speex audio processing library
brew "speexdsp"
# Sound system for POSIX OSes
brew "pulseaudio"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Ethernet compliant virtual network
brew "vde"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Create beautiful image of your source code
brew "silicon"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Editor of encrypted files
brew "sops"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Linter for Terraform files
brew "tflint"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool
brew "unison"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
brew "fujiwara/tap/aswrap", trusted: true
# cfft is a testing tool for CloudFront Functions.
brew "fujiwara/tap/cfft", trusted: true
# ECS Task Assistant tool.
brew "fujiwara/tap/ecsta", trusted: true
# lambroll is a minimal deployment tool for AWS Lambda.
brew "fujiwara/tap/lambroll", trusted: true
# Lookup resource attributes in tfstate.
brew "fujiwara/tap/tfstate-lookup", trusted: true
# ECS task event/log tracer CLI
brew "fujiwara/tap/tracer", trusted: true
# Bulk replace GitHub Actions references from version tags to commit hashes for locked, reproducible workflows.
brew "mashiike/tap/actionspin", trusted: true
# Install npm packages as Homebrew formula
brew "shuuuuun/tap/brew-npm", trusted: true
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# The Art of Reading Markdown.
cask "arto-app/tap/arto"
# Manage team projects and tasks
cask "asana"
# Two-factor authentication software
cask "authy"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web debugging Proxy application
cask "charles"
# Terminal-based AI coding assistant
cask "claude-code"
# Clipboard extension app
cask "clipy"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Run Stable Diffusion locally
cask "diffusionbee"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Tool to turn any web page into a desktop app
cask "flotato"
cask "font-anonymous-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Japanese input software
cask "google-japanese-ime"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# Noise cancelling application
cask "krisp"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
