tap "aws/tap"
tap "b4b4r07/tap"
tap "caskroom/cask"
tap "eugenmayer/dockersync"
tap "fujiwara/tap"
tap "github/gh"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k1low/tap"
tap "kayac/tap"
tap "knqyf263/utern"
tap "minamijoyo/tfupdate"
tap "mutagen-io/mutagen"
tap "railwaycat/emacsmacport"
tap "remind101/formulae"
tap "shuuuuun/tap"
tap "tkengo/highway"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Image manipulation library
brew "jpeg"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# YAML Parser
brew "libyaml"
# Official Amazon AWS command-line interface
brew "awscli@1"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Asynchronous DNS library
brew "c-ares"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# C++ library for large-scale optimization
brew "ceres-solver"
# Computational Geometry Algorithms Library
brew "cgal"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose", link: false
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr", link: false
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# HTTP/2 C Library
brew "nghttp2"
# GNU Emacs text editor
brew "emacs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# NaCl networking and cryptography library
brew "libsodium"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# GNOME XML library
brew "libxml2", link: true
# Framework for scientific data networking
brew "libdap"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Validating XML parser
brew "xerces-c"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
brew "gem-html2haml"
brew "gem-irep"
brew "gem-pry"
brew "gem-rails"
brew "gem-rails-erd"
brew "gem-rebi"
brew "gem-rubocop"
brew "gem-rubocop-rails"
brew "gem-solargraph"
brew "gem-twurl"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Perceptual JPEG encoder
brew "guetzli"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Process manager for Procfile-based applications
brew "hivemind"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase", link: true
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Load testing and performance measurement application
brew "jmeter"
# Utility to optimize JPEG files
brew "jpegoptim"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Terminal file manager
brew "lf"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Cartographic Projections Library
brew "proj"
# Allows SpatiaLite to support ST_MakeValid() like PostGIS
brew "liblwgeom"
# C XSLT library for GNOME
brew "libxslt"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Improved JPEG encoder
brew "mozjpeg"
# Open source relational database management system
brew "mysql@5.7", link: true
# Wrap web apps natively
brew "nativefier"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Statically typed compiled systems programming language
brew "nim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
brew "npm-clasp"
brew "npm-koko"
brew "npm-lighthouse"
brew "npm-rgb-hex-cli"
brew "npm-serverless"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# PNG file optimizer
brew "optipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@10"
# Sound system for POSIX OSes
brew "pulseaudio"
# Cross-platform application and UI framework
brew "qt", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Emulator for x86 and PowerPC
brew "qemu"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Editor of encrypted files
brew "sops"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Linter for Terraform files
brew "tflint"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Google's open source JavaScript engine
brew "v8@3.15"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Replacement for UNIX rm command!
brew "b4b4r07/tap/gomi"
# A layer for unison-fsmonitor arround either macfsevents or watchdog for usage with unison
brew "eugenmayer/dockersync/unox"
brew "fujiwara/tap/aswrap"
brew "fujiwara/tap/lambroll"
brew "fujiwara/tap/tracer"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
brew "kayac/tap/ecspresso"
# Multi group and stream log tailing for AWS CloudWatch Logs
brew "knqyf263/utern/utern"
# Update version constraints in your Terraform configurations
brew "minamijoyo/tfupdate/tfupdate"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# Install npm packages as Homebrew formula
brew "shuuuuun/tap/brew-npm"
# High performance source code search tool.
brew "tkengo/highway/highway"
# Two-factor authentication software
cask "authy"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Clipboard extension app
cask "clipy"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Tool to turn any web page into a desktop app
cask "flotato"
cask "google-japanese-ime"
# Keyboard customizer
cask "karabiner-elements"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "nosql-workbench-for-amazon-dynamodb"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
cask "tcl"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Open-source code editor
cask "visual-studio-code"
